Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: The path property is set to path the directory that was opened.
pt_br: A propriedade path é configurada para o caminho que o diretório foi aberto.

source: Three methods are available: read, rewind and close.
pt_br: Três métodos disponibilizados são: read, rewind e close.

source: Please note the fashion in which dir() 's return value is checked in the example below.
pt_br: Repare nos detalhes de como o valor retornado de dir() é verificado no exemplo abaixo.

source: We are explicitly testing whether the return value is identical to (equal to and of the same type as--see Comparison Operators for more information) FALSE since otherwise, any directory entry whose name evaluates to FALSE will stop the loop.
pt_br: Nós explicitamente testamos se valor de retorno é idêntico (igual e do mesmo tipo que -- - veja operadores de comparação para mais detalhes) a FALSE, desde que, de outra forma, qualquer entrada de diretório que seja avaliada para FALSE fará parar o loop.

source: Example 1. dir() example
pt_br: Exemplo dir()

source: $d = dir( "/ etc"); echo "Handle: ".$d - handle." br \n"; echo "Path: ".$d - path. "br \n"; while (false !== ($entry = $d - read())) {echo $entry." br \n";} $d - close();
pt_br: $d = dir( "/ etc"); echo "Manipulador: ".$d - handle." br \n"; echo "Caminho: ".$d - path. "br \n"; while (false !== ($entry = $d - read())) {echo $entry." br \n";} $d - close();

source: The order in which directory entries are returned by the read method is system-dependent.
pt_br: A ordem em que os diretórios são retornadas pelo método é dependente do sistema.

source: This defines the internal class Directory, meaning that you will not be able to define your own classes with that name.
pt_br: Este módulo define a classe interna Directory, significando que você não será capaz de criar uma classe sua com esse nome.

source: For a full list of predefined classes in PHP, please see Predefined Classes.
pt_br: Para uma lista completa das classes predefinidas no PHP, veja em Classes Predefinidas.

source: Chapter 4.
pt_br: Capítulo 4.

source: Configuration
pt_br: Configuração

source: When using PHP as an Apache module, you can also change the configuration settings using directives in Apache configuration files (e.g. httpd.conf) and .htaccess files (You will need "AllowOverride Options "or "AllowOverride All" privileges)
pt_br: Rodando o PHP como módulo do Apache

source: For a listing of which directives are PHP_INI_ALL, PHP_INI_PERDIR, or PHP_INI_SYSTEM, have a look at the table found within the ini_set() documentation.
pt_br: Quando usando o PHP como um módulo do Apache, você também pode mudar as definições de configuração usando diretivas na configuração do Apache (httpd.conf) e dos arquivos .htaccess (Você irá precisar de privilégios "AllowOverride Options "ou "AllowOverride All")

source: With PHP 3.0, there are Apache directives that correspond to each configuration setting in the php3.ini name, except the name is prefixed by "php3_".
pt_br: Com o PHP 3.0, existem diretivas Apache que correspondem a cada definição de configuração no nome php3.ini, exceto o nome predefinido por "php3_".

source: Can be used only with PHP_INI_ALL and PHP_INI_PERDIR type directives.
pt_br: Com o PHP 4.0, existem várias diretivas do Apache que lhe permitem mudar a configuração PHP dentro do arquivo de configuração do Apache.

source: To clear a previously set value use none as the value.
pt_br: Isso define o valor da variável especificada.

source: Used to set a Boolean configuration directive.
pt_br: Isto é usado para definir uma opção de configuração Booleana.

source: This can NOT be used in .htaccess files.
pt_br: Definições de configuração "Admin" só podem ser definidas a partir dos arquivos principais de configuração do Apache, e não dos arquivos .htaccess.

source: Any directive type set with php_admin_value can not be overridden by .htaccess or virtualhost directives.
pt_br: Exemplo 4-2.

source: Example 4-2.
pt_br: Nota:

source: Apache configuration example
pt_br: Constantes PHP não existem fora do PHP.

source: PHP constants do not exist outside of PHP.
pt_br: Nesses casos, utilize seus valores de bit.

source: Use the associated bitmask values instead.
pt_br: Outras interfaces para o PHP

source: Regardless of the interface to PHP you can change certain values at runtime of your scripts through ini_set().
pt_br: Independentemente da interface do PHP, você pode mudar certos valores em tempo de execução em seus scripts através ini_set().

source: The following table provides an overview at which level a directive can be set / changed.
pt_br: A tabela seguinte explica em que nível as diretivas podem ser modificadas.

source: Table 4-1.
pt_br: Tabela 4-1.

source: Definition of PHP_INI_* constants
pt_br: Definições das constantes PHP_INI_*

source: Constant
pt_br: Constante

source: Value
pt_br: Valor

source: Meaning
pt_br: Significado

source: Entry can be set in user scripts
pt_br: Diretiva pode ser modificada em seus scripts

source: Entry can be set in php.ini, .htaccess or httpd.conf
pt_br: Diretiva pode ser modificada no .htaccess e nas diretivas VHost do httpd.conf.

source: Entry can be set in php.ini or httpd.conf
pt_br: Diretiva pode ser modificada no php.ini ou httpd.conf (mas não em blocos VHost do httpd.conf).

source: Entry can be set anywhere
pt_br: Diretiva pode ser modificada em qualquer lugar

source: You can view the settings of the configuration values in the output of phpinfo().
pt_br: Você pode visualizar as configurações das diretivas na saída de phpinfo().

source: You can also access the values of individual configuration directives using ini_get() or get_cfg_var().
pt_br: Você também pode acessar os valores individuais das configurações utilizando ini_get() ou get_cfg_var().

source: Configuration directives
pt_br: Diretivas de configuração

source: Table 4-2.
pt_br: Diretivas de configuração

source: Httpd Options
pt_br: Opções Httpd

source: Name
pt_br: Tabela 4-2.

source: Default
pt_br: Opções Httpd

source: Changeable
pt_br: Padrão

source: async_send
pt_br: Alterável

source: Table 4-3.
pt_br: Opções da Linguagem

source: Language and Misc Configuration Options
pt_br: Opções gerais da linguagem

source: Here is a short explanation of the configuration directives.
pt_br: Descrição resumida das diretivas de configuração.

source: Tells whether the short form (??) of PHP's open tag should be allowed.
pt_br: Informa quando a tag reduzida (??) do PHP pode ser permitida.

source: If you want to use PHP in combination with XML, you can disable this option in order to use ?xml? inline.
pt_br: Se você quiser usar o PHP em combinação com XML, você pode desligar essa opção para poder utilizar ?xml? inline.

source: Otherwise, you can print it with PHP, for example: ?php echo '?xml version="1.0"';?.
pt_br: De outra forma, você pode imprimir com o PHP, por exemplo: ?php echo '?xml version="1.0"';?.

source: Also if disabled, you must use the long form of the PHP open tag (?php?).
pt_br: Se desligado, você precisará utilizar a forma longa da tag de abertura do PHP (?php?).

source: This directive also affects the shorthand ?=, which is identical to? echo.
pt_br: Esta diretiva também afeta o atalho ?=, que é idêntico a? echo.

source: Use of this shortcut requires short_open_tag to be on.
pt_br: A utilização desse atalho requer short_open_tag ligado.

source: Enables the use of ASP-like%% tags in addition to the usual ?php? tags.
pt_br: Ativa a utilização das tags estilo ASP%% em adição as tags ?php?.

source: This includes the variable-value printing shorthand of %= $value%.
pt_br: Isto inclui o atalho de impressão de valores %= $var%.

source: For more information, see Escaping from HTML.
pt_br: Para mais informações, veja Alternando do HTML.

source: Support for ASP-style tags was added in 3.0.4.
pt_br: O suporte a tags estilo APS foi acrescentado no 3.0.4.

source: The number of significant digits displayed in floating point numbers.
pt_br: O número de dígitos significantes exibidos em números de ponto flutuante.

source: Enforce year 2000 compliance (will cause problems with non-compliant browsers)
pt_br: Força a especificação Ano 2002 (poderá causar problemas com browsers não compatíveis)

source: Whether to enable the ability to force arguments to be passed by reference at function call time.
pt_br: Especifica a habilidade em forçar que argumentos possam ser passados por referência na chamada de uma função.

source: This method is deprecated and is likely to be unsupported in future versions of PHP / Zend.
pt_br: Este método é obsoleto e logo não será mais suportado nas futuras versões do PHP / Zend.

source: The encouraged method of specifying which arguments should be passed by reference is in the function declaration.
pt_br: O método recomendado para especificar que argumentos devem ser passados por referência é pela declaração da função.

source: You' re encouraged to try and turn this option Off and make sure your scripts work properly with it in order to ensure they will work with future versions of the language (you will receive a warning each time you use this feature, and the argument will be passed by value instead of by reference).
pt_br: Você é encorajado em tentar desligar essa opção e verificar se seus scripts trabalham adequadamente de forma a garantir que elas irã funcionar nas futuras versões da linguagem (você receberá um alerta cada vez que utilizar esse recurso, e o argumento será passado por valor em vez de por referência).

source: See also References Explained.
pt_br: Veja também Referências Explicadas.

source: Decides whether PHP may expose the fact that it is installed on the server (e.g. by adding its signature to the Web server header).
pt_br: Decide se o PHP poderá expor o fato de que ele está instalado no servidor (acrescentando sua assinatura no header do servidor web).

source: It is no security threat in any way, but it makes it possible to determine whether you use PHP on your server or not.
pt_br: Isto não causa problemas de segurança de qualquer forma, mas torna possível determinar se você usa o PHP em seu servidor ou não.

source: Resource Limits
pt_br: Limitação de recursos

source: memory_limit
pt_br: Padrão

source: "8M"
pt_br: Alterável

source: This sets the maximum amount of memory in bytes that a script is allowed to allocate.
pt_br: Descrição resumida das diretivas de configuração.

source: This helps prevent poorly written scripts for eating up all available memory on a server.
pt_br: Isto configura a quantidade máxima de memória, em bytes, que um script poderá alocar.

source: In order to use this directive you must have enabled it at compile time.
pt_br: Isto ajuda a prevenir que scripts mal escritos acabem com toda a memória disponível do servidor.

source: So, your configure line would have included: --enable-memory-limit.
pt_br: Veja também max_execution_time.

source: Note that you have to set it to -1 if you don 't want any limit for your memory.
pt_br: Manipulação de dados

source: See also: max_execution_time.
pt_br: Tabela 4-5.

source: Data Handling Configuration Options
pt_br: Opções configuráveis para manipulação de dados

source: If enabled, then Environment, GET, POST, Cookie, and Server variables can be found in the global associative arrays $_ENV, $_GET, $_POST, $_COOKIE, and $_SERVER.
pt_br: Se ativado, quaisquer variáveis Environment, GET, POST, Cookie e Server encontradas poderão ser acessadas nos arrays globais associativos $_ENV, $_GET, $_POST, $_COOKIE e $_SERVER.

source: Note that as of PHP 4.0.3, track_vars is always turned on.
pt_br: Note que a partir do PHP 4.0.3, track_vars está sempre ativado.

source: The separator used in PHP generated URLs to separate arguments.
pt_br: O separador de parâmetros em URLs geradas pelo PHP.

source: List of separator( s) used by PHP to parse input URLs into variables.
pt_br: Lista dos separador( es) utilizados pelo PHP para interpretar URLs em variáveis.

source: Every character in this directive is considered as separator!
pt_br: Cada caracter nesta diretiva é considerado como um separador!

source: Set the order of the EGPCS (Environment, GET, POST, Cookie, Server) variable parsing.
pt_br: Configura a ordem de interpretação das variáveis EGPCS (Environment, GET, POST, Cookie e Server).

source: The default setting of this directive is "EGPCS".
pt_br: O default dessa diretiva é "EGPCS".

source: Setting this to "GP", for example, will cause PHP to completely ignore environment variables, cookies and server variables, and to overwrite any GET method variables with POST-method variables of the same name.
pt_br: Configurando para "GP", por exemplo, fará com que o PHP ignore completamente variáveis de ambiente (E), cookies (C) e do servidor (S), sendo que qualquer variável GET será sobrescrita por qualquer variável do método POST com o mesmo nome.

source: See also register_globals.
pt_br: Veja também register_globals.

source: Tells whether or not to register the EGPCS (Environment, GET, POST, Cookie, Server) variables as global variables.
pt_br: Ativa ou não o registro de variáveis EGPCS (Environment, GET, POST, Cookie e Server) como variáveis globais.

source: For example; if register_globals = on, the url http: / /www.example.com / test.php?id=3 will produce $id.
pt_br: Por exemplo: se register_globals = on, a URL http: / /www.example.com / test.php?id=3 irá criar a variável $id.

source: Or, $DOCUMENT_ROOT from $_SERVER[ 'DOCUMENT_ROOT'].
pt_br: Ou, $DOCUMENT_ROOT de $_SERVER[ 'DOCUMENT_ROOT'].

source: You may want to turn this off if you don' t want to clutter your scripts' global scope with user data.
pt_br: Você pode desligar essa diretiva se você não deseja sujar o escopo global de seus scripts com dados do usuário.

source: As of PHP 4.2.0, this directive defaults to off.
pt_br: Desde o PHP 4.2.0, o padrão dessa diretiva é off.

source: It 's preferred to go through PHP Predefined Variables instead, such as the superglobals: $_ENV, $_GET, $_POST, $_COOKIE, and $_SERVER.
pt_br: É preferível utilizar as variáveis predefinidas do PHP, como as superglobals: $_ENV, $_GET, $_POST, $_COOKIE e $_SERVER.

source: Please read the security chapter on Using register_globals for related information.
pt_br: Leia cuidadosamente o capitulo de segurança em Utilizando register_globals para mais informações.

source: Please note that register_globals cannot be set at runtime (ini_set()).
pt_br: Veja que register_globals não pode ser alterado em tempo de execução (ini_set()).

source: Although, you can use .htaccess if your host allows it as described above.
pt_br: Entretanto, você pode utilizar o .htaccess Entretanto, você pode utilizar o .htaccess se seu host permitir como descrito anteriormente.

source: An example .htaccess entry: php_flag register_globals on.
pt_br: Um exemplo de entrada do .htaccess: php_flag register_globals on.

source: Tells PHP whether to declare the argv argc variables (that would contain the GET information).
pt_br: Configura quando o PHP deve declarar ou não as variáveis argv e argc (que podem conter dados do método GET).

source: See also command line.
pt_br: Veja também Utilizando o PHP em linha de comando.

source: Also, this directive became available in PHP 4.0.0 and was always "on" before that.
pt_br: Além, essa diretiva foi criada no PHP 4.0.0 e sempre foi "ativa" antes disso.

source: Sets max size of post data allowed.
pt_br: Configura o tamanho máximo dos dados postados.

source: This setting also affects file upload.
pt_br: Esta configuração também afeta o upload de arquivos.

source: To upload large files, this value must be larger than upload_max_filesize.
pt_br: Para receber arquivos grandes, esse valor precisa ser maior que upload_max_filesize.

source: If memory limit is enabled by your configure script, memory_limit also affects file uploading.
pt_br: Se o limite de memória estiver ativado em seu script de configuração, memory_limit também afeta o upload de arquivos.

source: Generally speaking, memory_limit should be larger than post_max_size.
pt_br: Falando diretamente, memory_limit precisa ser maior que post_max_size.

source: Set the order of GET / POST / COOKIE variable parsing.
pt_br: Informa a ordem de interpretação das variáveis GET / POST / COOKIE.

source: The default setting of this directive is "GPC".
pt_br: O padrão dessa diretiva é "GPC".

source: Setting this to "GP", for example, will cause PHP to completely ignore cookies and to overwrite any GET method variables with POST-method variables of the same name.
pt_br: Configurando para "GP", por exemplo, fará com que o PHP ignore completamente cookies e que sobrescreva qualquer dado postado via GET por variáveis postados via POST que tenham o mesmo nome.

source: This option is not available in PHP 4.
pt_br: Esta opção não está disponível no PHP 4.

source: Use variables_order instead.
pt_br: Utilize variables_order no seu lugar.

source: Specifies the name of a file that is automatically parsed before the main file.
pt_br: Especifica o nome do arquivo que será automaticamente interpretado antes do arquivo principal.

source: The file is included as if it was called with the include() function, so include_path is used.
pt_br: O arquivo é incluído como se ele fosse chamado com a função include(), então include_path é utilizado.

source: The special value none disables auto-prepending.
pt_br: O valor especial none desabilita a auto inclusão.

source: Specifies the name of a file that is automatically parsed after the main file.
pt_br: Especifica se o nome do arquivo que será automaticamente interpretado depois do arquivo principal.

source: The special value none disables auto-appending.
pt_br: O valor especial none desabilita a auto inclusão.

source: If the script is terminated with exit(), auto-append will not occur.
pt_br: Se o script é terminado com exit(), a auto inclusão não irá ocorrer.

source: As of 4.0b4, PHP always outputs a character encoding by default in the Content-type: header.
pt_br: A partir da versão 4.0b4, o PHP sempre emite a codificação de caracter por padrão no header Content-type:.

source: To disable sending of the charset, simply set it to be empty.
pt_br: Para desabilitar o envio do código de página, simplesmente deixe a diretiva em branco.

source: Always populate the $HTTP_RAW_POST_DATA variable.
pt_br: Sempre preenche a variável $HTTP_RAW_POST_DATA.

source: Allow handling of WebDAV http requests within PHP scripts (eg.
pt_br: Permite a manipulação de headers HTTP com scripts PHP (com PROPFIND, PROPPATCH, MOVE, COPY, etc).

source: PROPFIND, PROPPATCH, MOVE, COPY, etc..) If you want to get the post data of those requests, you have to set always_populate_raw_post_data as well.
pt_br: Veja também magic_quotes_gpc, magic-quotes-runtime, e magic_quotes_sybase.

source: See also: magic_quotes_gpc, magic-quotes-runtime, and magic_quotes_sybase.
pt_br: Paths and Directories

source: Table 4-6.
pt_br: Tabela 4-6.

source: Paths and Directories Configuration Options
pt_br: Opções de configuração de caminhos e diretórios

source: Specifies a list of directories where the require(), include() and fopen_with_path() functions look for files.
pt_br: Especifica a lista de diretórios onde as funções require(), include() and fopen_with_path() procurarão por arquivos.

source: The format is like the system 's PATH environment variable: a list of directories separated with a colon in UNIX or semicolon in Windows.
pt_br: O formato é o mesmo que o da variável ambiente PATH: uma lista de diretórios, separador por vírgula no UNIX ou ponto e vírgula no Windows.

source: UNIX include_path
pt_br: Exemplo 4-3. include_path UNIX

source: include_path=".: / php / includes "
pt_br: include_path=.: / home / httpd / php-lib

source: Windows include_path
pt_br: Exemplo 4-4. include_path Windows

source: include_path=" .;c:\php\includes "
pt_br: include_path=" .;c:\www\phplib "

source: Using a. in the include path allows for relative includes as it means the current directory.
pt_br: O "diretório root" do PHP no servidor.

source: PHP' s "root directory "on the server.
pt_br: Utilizado somente se for preenchido.

source: If PHP is configured with safe mode, no files outside this directory are served.
pt_br: Se o PHP estiver configurado com safe mode, nenhum arquivo acima desse diretório será acessível.

source: If PHP was not compiled with FORCE_REDIRECT, you SHOULD set doc_root if you are running php as a CGI under any web server (other than IIS) The alternative is to use the cgi.force_redirect configuration below.
pt_br: Se o PHP não estiver compilado com FORCE_REDIRECT, você DEVE configurar doc_root se estiver rodando o PHP como CGI sob qualquer servidor web (que não o IIS) Outra alternativa é configurar a diretiva cgi.force_redirect, abaixo.

source: The base name of the directory used on a user 's home directory for PHP files, for example public_html.
pt_br: O caminho base do usado como diretório home do usuário para arquivos PHP, por exemplo public_html.

source: In what directory PHP should look for dynamically loadable extensions.
pt_br: Diretório de onde o PHP poderá carregar dinamicamente as extensões.

source: See also: enable_dl, and dl().
pt_br: Veja também enable_dl e dl().

source: Which dynamically loadable extensions to load when PHP starts up.
pt_br: Que extensões dinamicamente carregáveis devem ser carregadas quando o PHP inicia.

source: cgi.force_redirect is necessary to provide security running PHP as a CGI under most web servers.
pt_br: cgi.force_redirect é necessário para prover segurança quando rodando o PHP como módulo sob a maioria dos servidores web.

source: Left undefined, PHP turns this on by default.
pt_br: Se deixado indefinido, o PHP assume como ativo.

source: You can turn it off AT YOUR OWN RISK.
pt_br: Você pode desligá-lo SOB SEU RISCO.

source: Windows Users:
pt_br: Usuários Windows:

source: You CAN safely turn this off for IIS, in fact, you MUST.
pt_br: Você PODE desligar isso no ISS, e de fato, você DEVE fazê-lo.

source: To get OmniHTTPD or Xitami to work you MUST turn it off.
pt_br: Para que o OmniHTTPD ou Xitami funcionem, você PRECISA desligá-lo.

source: If cgi.force_redirect is turned on, and you are not running under Apache or Netscape (iPlanet) web servers, you MAY need to set an environment variable name that PHP will look for to know it is OK to continue execution.
pt_br: Se cgi.force_redirect estiver ativado, e se não estiver rodando o PHP sob os servidores web Apache ou Netscape (iPlanet), você PRECISARÁ configurar uma variável de ambiente que o PHP procurará para saber se ele pode continuar a execução.

source: Setting this variable MAY cause security issues, KNOW WHAT YOU ARE DOING FIRST.
pt_br: Configurar essa variável PODERÁ causar problemas de segurança, POR ISSO SAIBA QUE ESTEJA FAZENDO PRIMEIRO.

source: FastCGI under IIS (on WINNT based OS) supports the ability to impersonate security tokens of the calling client.
pt_br: FastCGI sob o IIS (em sistemas baseados em WinNT) suporta a habilidade de despersonalizar tokens de segurança da chamado do cliente.

source: This allows IIS to define the security context that the request runs under. mod_fastcgi under Apache does not currently support this feature (03 / 17 / 2002) Set to 1 if running under IIS.
pt_br: Configure 1 se estiver rodando sob o ISS.

source: Default is zero.
pt_br: O padrão é zero.

source: Table 4-7.
pt_br: Upload de arquivos

source: File Uploads Configuration Options
pt_br: Opções de configuração para upload de arquivos

source: Whether or not to allow HTTP file uploads.
pt_br: Permite ou não upload de arquivos HTTP.

source: See also the upload_max_filesize, upload_tmp_dir, and post_max_size directives.
pt_br: Veja também upload_max_filesize, upload_tmp_dir e post_max_size directives.
